УТ/src/InformationRegisters/CRM_НастройкиРабочегоСтола/CRM_НастройкиРабочегоСтола.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиРабочегоСтола</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Параметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Скрытая</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_НастройкиРабочегоСтола/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодразделения = CRM_ОбщегоНазначенияПовтИсп.ИспользоватьПодразделения();
	
	ВидНастроек = ?(ИспользоватьПодразделения, 0, 1);
	Элементы.ВидНастроек.Видимость = ИспользоватьПодразделения;Элементы.ВидНастроек.Видимость = ИспользоватьПодразделения;
	
	Если ЗначениеЗаполнено(Запись.Объект) Тогда
		Если ТипЗнч(Запись.Объект) = Тип("Строка") Тогда
			ВидНастроек = 0;
		ИначеЕсли ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.Пользователи") Тогда
			Пользователь = Запись.Объект;
			ВидНастроек = 1;
		ИначеЕсли ИспользоватьПодразделения Тогда
			Подразделение = Запись.Объект;
			ВидНастроек = 2;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеВидимостью();
	Элементы.ИмяФормы.СписокВыбора.ЗагрузитьЗначения(CRM_РабочийСтолСервер.ПолучитьСписокДоступныхФорм().ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ВидНастроек = 0 Тогда
		ТекущийОбъект.Объект = "Общие настройки";
	ИначеЕсли ВидНастроек = 1 Тогда
		ТекущийОбъект.Объект = Пользователь;
	Иначе
		ТекущийОбъект.Объект = Подразделение;
	КонецЕсли;
	ТекущийОбъект.Идентификатор = Новый УникальныйИдентификатор;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНастроекПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостью()
	Если ВидНастроек = 0 Тогда
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Ложь;
	ИначеЕсли ВидНастроек = 1 Тогда
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Истина;
	Иначе
		Элементы.Подразделение.Видимость = Истина;
		Элементы.Пользователь.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти
